renesas/rx-driver-package/source/r_riichs_rx/r_riichs_rx_vx.xx/r_riichs_rx/src/targets/rx671/r_riichs_rx671.c
/***********************************************************************************************************************
 * DISCLAIMER
 * This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products.
 * No other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all 
 * applicable laws, including copyright laws. 
 * THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
 * THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY, 
 * FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM 
 * EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES 
 * SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO 
 * THIS SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of 
 * this software. By using this software, you agree to the additional terms and conditions found by accessing the 
 * following link:
 * http://www.renesas.com/disclaimer 
 *
 * Copyright (C) 2021 Renesas Electronics Corporation. All rights reserved.
 **********************************************************************************************************************/
/***********************************************************************************************************************
 * File Name    : r_riichs_rx671.c
 * Description  : Functions for using RIICHS on RX devices. 
 **********************************************************************************************************************/
/**********************************************************************************************************************
 * History : DD.MM.YYYY Version  Description
 *         : 30.06.2021 1.00     First Release
 **********************************************************************************************************************/

/***********************************************************************************************************************
 Includes   <System Includes> , "Project Includes"
 **********************************************************************************************************************/
/* Defines for RIICHS support */
#include "r_riichs_rx_if.h"

/* Check MCU Group */
#if defined(BSP_MCU_RX671)

    #include "r_riichs_rx_private.h"

/***********************************************************************************************************************
 Exported global variables (to be accessed by other files)
 **********************************************************************************************************************/

/***********************************************************************************************************************
 Private global variables and functions
 **********************************************************************************************************************/
    #if (1U == RIICHS_CFG_PORT_SET_PROCESSING)
/***********************************************************************************************************************
 * Function Name: riichs_mcu_io_open
 * Description  : Sets ports to input mode.
 *              : Ports input pull-up becomes "Off".
 * Arguments    : uint8_t channel
 * Return Value : None
 **********************************************************************************************************************/
void riichs_mcu_io_open (uint8_t channel)
{
    volatile uint8_t uctmp = 0x00;
    R_BSP_VOLATILE_EVENACCESS uint8_t * ppcr = NULL;
    R_BSP_VOLATILE_EVENACCESS uint8_t * ppdr = NULL;
    uint8_t port_gr = 0;
    uint8_t pin_num = 0;

    /* Channel number? */
    switch (channel)
    {
        #if (1U == RIICHS_CFG_CH0_INCLUDED)
        case 0x00 : /* Channel 0 */

            /* Sets the port register of SCL pin. */
            port_gr = RIICHS_CH0_SCL0_GP;
            pin_num = RIICHS_CH0_SCL0_PIN;
            ppcr = (uint8_t *)((uint32_t)RIICHS_PRV_PCR_BASE_REG + (uint32_t)port_gr);
            ppdr = (uint8_t *)((uint32_t)RIICHS_PRV_PDR_BASE_REG + (uint32_t)port_gr);
            (*ppcr) &= (~(1U << pin_num)); /* SCL0 input pull-up resister : off */
            (*ppdr) &= (~(RIICHS_IN << pin_num)); /* SCL0 input mode */

            /* Sets the port register of SDA pin. */
            port_gr = RIICHS_CH0_SDA0_GP;
            pin_num = RIICHS_CH0_SDA0_PIN;
            ppcr = (uint8_t *)((uint32_t)RIICHS_PRV_PCR_BASE_REG + (uint32_t)port_gr);
            ppdr = (uint8_t *)((uint32_t)RIICHS_PRV_PDR_BASE_REG + (uint32_t)port_gr);
            (*ppcr) &= (~(1U << pin_num)); /* SDA0 input pull-up resister : off */
            (*ppdr) &= (~(RIICHS_IN << pin_num)); /* SDA0 input mode */
            uctmp = (*ppdr); /* Reads PDR. */
        break;
        #endif

        default :

            /* Please add a channel as needed. */
        break;
    }
} /* End of function riichs_mcu_io_open() */

/***********************************************************************************************************************
 * Function Name: riichs_mcu_mpc_enable
 * Description  : Enables RIICHS multi-function pin controller.
 * Arguments    : uint8_t channel
 * Return Value : None
 **********************************************************************************************************************/
void riichs_mcu_mpc_enable (uint8_t channel)
{
    volatile uint8_t uctmp = 0x00;
    R_BSP_VOLATILE_EVENACCESS uint8_t * ppmr = NULL;
    R_BSP_VOLATILE_EVENACCESS uint8_t * ppfs = NULL;
    uint8_t port_gr = 0;
    uint8_t pin_num = 0;

    /* The upper layer software should call "riichs_disable()." */
    /* The upper layer software should set SCL and SDA ports to input mode using PDR. */
    /* The upper layer software should perform RIICHS reset or internal reset. */

    /* Channel number? */
    switch (channel)
    {
        #if (1U == RIICHS_CFG_CH0_INCLUDED)
        case 0x00 : /* Channel 0 */
            port_gr = RIICHS_CH0_SCL0_GP;
            pin_num = RIICHS_CH0_SCL0_PIN;
            ppmr = (uint8_t *)((uint32_t)RIICHS_PRV_PMR_BASE_REG + (uint32_t)port_gr);
            (*ppmr) &= (~(1U << pin_num)); /* Uses as a GPIO (Input port). */

            port_gr = RIICHS_CH0_SDA0_GP;
            pin_num = RIICHS_CH0_SDA0_PIN;
            ppmr = (uint8_t *)((uint32_t)RIICHS_PRV_PMR_BASE_REG + (uint32_t)port_gr);
            (*ppmr) &= (~(1U << pin_num)); /* Uses as a GPIO (Input port). */

            /* Specifies the assignments of input/output signals for peripheral functions to the desired pins.
             But SCL and SDA are already in a high-impedance state.
             Because the upper layer software called "riichs_reset_set()". */

            R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_MPC); /* Enables the PFS register writing. */

            port_gr = RIICHS_CH0_SCL0_GP;
            pin_num = RIICHS_CH0_SCL0_PIN;
            ppfs = (uint8_t *)((uint32_t)RIICHS_PRV_PFS_BASE_REG + (uint32_t)((port_gr * 8) + pin_num));
            (*ppfs) = RIICHS_MPC_SCL0_ENABLE; /* Pin function select to RIICHS SCL pin. */

            port_gr = RIICHS_CH0_SDA0_GP;
            pin_num = RIICHS_CH0_SDA0_PIN;
            ppfs = (uint8_t *)((uint32_t)RIICHS_PRV_PFS_BASE_REG + (uint32_t)((port_gr * 8) + pin_num));
            (*ppfs) = RIICHS_MPC_SDA0_ENABLE; /* Pin function select to RIICHS SDA pin. */

            R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_MPC); /* Disables the PFS register writing. */

            port_gr = RIICHS_CH0_SCL0_GP;
            pin_num = RIICHS_CH0_SCL0_PIN;
            ppmr = (uint8_t *)((uint32_t)RIICHS_PRV_PMR_BASE_REG + (uint32_t)port_gr);
            (*ppmr) |= (1U << pin_num); /* Uses as RIICHS (SCL). */
            uctmp = (*ppmr); /* Reads PMR. */

            port_gr = RIICHS_CH0_SDA0_GP;
            pin_num = RIICHS_CH0_SDA0_PIN;
            ppmr = (uint8_t *)((uint32_t)RIICHS_PRV_PMR_BASE_REG + (uint32_t)port_gr);
            (*ppmr) |= (1U << pin_num); /* Uses as RIICHS (SDA). */
            uctmp = (*ppmr); /* Reads PMR. */
        break;
        #endif

        default :

