renesas/rx-driver-package/source/r_riichs_rx/r_riichs_rx_vx.xx/r_riichs_rx/src/targets/rx671/r_riichs_rx671.c
            /* Please add a channel as needed. */
        break;
    }
} /* End of function riichs_mcu_mpc_enable() */

/***********************************************************************************************************************
 * Function Name: riichs_mcu_mpc_disable
 * Description  : Disables RIICHS multi-function pin controller.
 * Arguments    : uint8_t channel
 * Return Value : None
 **********************************************************************************************************************/
void riichs_mcu_mpc_disable (uint8_t channel)
{
    volatile uint8_t uctmp = 0x00;
    R_BSP_VOLATILE_EVENACCESS uint8_t * ppmr = NULL;
    R_BSP_VOLATILE_EVENACCESS uint8_t * ppfs = NULL;
    uint8_t port_gr = 0;
    uint8_t pin_num = 0;

    /* The upper layer software should set SCL snd SDA ports to input mode using PDR. */

    /* Channel number? */
    switch (channel)
    {
        #if (1U == RIICHS_CFG_CH0_INCLUDED)
        case 0x00 : /* Channel 0 */
            port_gr = RIICHS_CH0_SCL0_GP;
            pin_num = RIICHS_CH0_SCL0_PIN;
            ppmr = (uint8_t *)((uint32_t)RIICHS_PRV_PMR_BASE_REG + (uint32_t)port_gr);
            (*ppmr) &= (~(1U << pin_num)); /* Uses as a GPIO (Input port). */

            port_gr = RIICHS_CH0_SDA0_GP;
            pin_num = RIICHS_CH0_SDA0_PIN;
            ppmr = (uint8_t *)((uint32_t)RIICHS_PRV_PMR_BASE_REG + (uint32_t)port_gr);
            (*ppmr) &= (~(1U << pin_num)); /* Uses as a GPIO (Input port). */

            R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_MPC); /* Enables the PFS register writing. */

            port_gr = RIICHS_CH0_SCL0_GP;
            pin_num = RIICHS_CH0_SCL0_PIN;
            ppfs = (uint8_t *)((uint32_t)RIICHS_PRV_PFS_BASE_REG + (uint32_t)((port_gr * 8) + pin_num));
            (*ppfs) = RIICHS_MPC_SCL0_INIT; /* Pin function select to Hi-Z. */

            port_gr = RIICHS_CH0_SDA0_GP;
            pin_num = RIICHS_CH0_SDA0_PIN;
            ppfs = (uint8_t *)((uint32_t)RIICHS_PRV_PFS_BASE_REG + (uint32_t)((port_gr * 8) + pin_num));
            (*ppfs) = RIICHS_MPC_SDA0_INIT; /* Pin function select to Hi-Z. */

            R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_MPC); /* Disables the PFS register writing. */
        break;
        #endif

        default :

            /* Please add a channel as needed. */
        break;
    }
    uctmp = RIICHS_PWPR_BOWI; /* Reads PWPR. */
} /* End of function riichs_mcu_mpc_disable() */
    #endif

/***********************************************************************************************************************
 * Function Name: riichs_param_check
 * Description  : Checks NULL for pointer variable.
 * Arguments    : uint8_t channel
 * Return Value : true                   : pointer variable is not NULL.
 *                false                  : pointer variable is NULL.
 **********************************************************************************************************************/
bool riichs_param_check (riichs_info_t * p_riichs_info)
{
    bool ret = true;

    if (NULL == p_riichs_info)
    {
        ret = false;
    }

    return ret;
} /* End of function riichs_param_check() */

/***********************************************************************************************************************
 * Function Name: riichs_slave_address_check
 * Description  : Checks range of slave address.
 * Arguments    : uint8_t format
 *              : uint16_t address
 * Return Value : true                   : address is in range.
 *                false                  : address is out of range.
 **********************************************************************************************************************/
bool riichs_slave_address_check (uint8_t format, uint16_t address)
{
    bool ret = false;

    if (1U == format)
    {
        if (0x007FU >= address)
        {
            ret = true;
        }
    }
    else if (2U == format)
    {
        if (0x03FF >= address)
        {
            ret = true;
        }
    }
    else if (0U == format)
    {
        ret = true;
    }
    return ret;
} /* End of function riichs_slave_address_check() */

/***********************************************************************************************************************
 * Function Name: riichs_mcu_check_channel
 * Description  : Checks channel is valid or not.
 * Arguments    : uint8_t channel
 * Return Value : true                   : RIICHS channel is valid.
 *                false                  : RIICHS channel is invalid.
 **********************************************************************************************************************/
bool riichs_mcu_check_channel (uint8_t channel)
{
    bool ret = false;

    switch (channel)
    {

    #if (1U == RIICHS_CFG_CH0_INCLUDED)
        case 0x00 :
            ret = true;
        break;
    #endif

        default :

            /* The channel number is invalid. */
            ret = false;
        break;
    }

    return ret;
} /* End of function riichs_mcu_check_channel() */

/***********************************************************************************************************************
 * Function Name: riichs_mcu_int_init
 * Description  : Registers a callback function for supported TEI and EEI group interrupts.
 * Arguments    : uint8_t channel
 * Return Value : None
 **********************************************************************************************************************/
void riichs_mcu_int_init (uint8_t channel)
{
    switch (channel)
    {
    #if (1U == RIICHS_CFG_CH0_INCLUDED)
        case 0x00 :
            R_BSP_InterruptWrite(BSP_INT_SRC_AL1_RIICHS0_EEI, (bsp_int_cb_t) riichs0_eei_isr);
            R_BSP_InterruptWrite(BSP_INT_SRC_AL1_RIICHS0_TEI, (bsp_int_cb_t) riichs0_tei_isr);
        break;
    #endif

        default :

            /* Do Nothing */
        break;
    }
} /* End of function riichs_mcu_int_init() */

