renesas/rx-driver-package/source/r_riichs_rx/r_riichs_rx_vx.xx/r_riichs_rx/src/targets/rx671/r_riichs_rx671.c
/***********************************************************************************************************************
 * Function Name: riichs_mcu_check_ir_txi
 * Description  : Check TXI interrupt request register.
 * Arguments    : uint8_t channel
 * Return Value : RIICHS_IR_CLR         : TXI Interrupt request (IR) register is cleared.
 *              : RIICHS_IR_SET         : TXI Interrupt request (IR) register is set.
 **********************************************************************************************************************/
uint8_t riichs_mcu_check_ir_txi (uint8_t channel)
{
    uint8_t ret = RIICHS_IR_CLR;

    switch (channel)
    {
    #if (1U == RIICHS_CFG_CH0_INCLUDED)
        case 0x00 :
            ret = RIICHS_IR_TXI0;
        break;
    #endif

        default :

            /* Should never get here. Valid channel number is checked above. */
        break;
    }

    return ret;
} /* End of function riichs_mcu_check_ir_txi() */

/***********************************************************************************************************************
 * Function Name: riichs_mcu_check_ir_rxi
 * Description  : Check RXI interrupt request register.
 * Arguments    : uint8_t channel
 * Return Value : RIICHS_IR_CLR         : TXI Interrupt request (IR) register is cleared.
 *              : RIICHS_IR_SET         : TXI Interrupt request (IR) register is set.
 **********************************************************************************************************************/
uint8_t riichs_mcu_check_ir_rxi (uint8_t channel)
{
    uint8_t ret = RIICHS_IR_CLR;

    switch (channel)
    {
    #if (1U == RIICHS_CFG_CH0_INCLUDED)
        case 0x00 :
            ret = RIICHS_IR_RXI0;
        break;
    #endif

        default :

            /* Should never get here. Valid channel number is checked above. */
        break;
    }

    return ret;
} /* End of function riichs_mcu_check_ir_rxi() */

/***********************************************************************************************************************
 * Function Name: riichs_mcu_clear_ir_txi
 * Description  : Clear TXI interrupt request register.
 * Arguments    : uint8_t channel
 * Return Value : none
 **********************************************************************************************************************/
void riichs_mcu_clear_ir_txi (uint8_t channel)
{
    switch (channel)
    {
    #if (1U == RIICHS_CFG_CH0_INCLUDED)
        case 0x00 :
            RIICHS_IR_TXI0 = RIICHS_IR_CLR; /* Clears TXI interrupt request register. */
            if (RIICHS_IR_CLR == RIICHS_IR_TXI0)
            {
                /* Do Nothing */
            }
        break;
    #endif

        default :

            /* Should never get here. Valid channel number is checked above. */
        break;
    }
} /* End of function riichs_mcu_clear_ir_txi() */

/***********************************************************************************************************************
 * Function Name: riichs_mcu_clear_ir_rxi
 * Description  : Clear RXI interrupt request register.
 * Arguments    : uint8_t channel
 * Return Value : none
 **********************************************************************************************************************/
void riichs_mcu_clear_ir_rxi (uint8_t channel)
{
    switch (channel)
    {
    #if (1U == RIICHS_CFG_CH0_INCLUDED)
        case 0x00 :
            RIICHS_IR_RXI0 = RIICHS_IR_CLR; /* Clears TXI interrupt request register. */
            if (RIICHS_IR_CLR == RIICHS_IR_RXI0)
            {
                /* Do Nothing */
            }
        break;
    #endif

        default :

            /* Should never get here. Valid channel number is checked above. */
        break;
    }
} /* End of function riichs_mcu_clear_ir_rxi() */

/***********************************************************************************************************************
 * Function Name: riichs_mcu_hardware_lock
 * Description  : Attempt to acquire the lock that has been sent in.
 * Arguments    : uint8_t channel
 * Return Value : true                   ; Successful operation
 *              : false                  ; error operation
 **********************************************************************************************************************/
bool riichs_mcu_hardware_lock (uint8_t channel)
{
    bool chk = false;

    switch (channel)
    {
    #if (1U == RIICHS_CFG_CH0_INCLUDED)
        case 0x00 :
            chk = R_BSP_HardwareLock(BSP_LOCK_RIICHS0);
        break;
    #endif

        default :

            /* Do Nothing */
        break;
    }
    return chk;
} /* End of function riichs_mcu_hardware_lock() */

/***********************************************************************************************************************
 * Function Name: riichs_mcu_hardware_unlock
 * Description  : Release hold on lock.
 * Arguments    : uint8_t channel
 * Return Value : none
 **********************************************************************************************************************/
void riichs_mcu_hardware_unlock (uint8_t channel)
{
    switch (channel)
    {
    #if (1U == RIICHS_CFG_CH0_INCLUDED)
        case 0x00 :
            R_BSP_HardwareUnlock(BSP_LOCK_RIICHS0);
        break;
    #endif

        default :

            /* Do Nothing */
        break;
    }
} /* End of function riichs_mcu_hardware_unlock() */

/***********************************************************************************************************************
 * Function Name: riichs_mcu_power_on
 * Description  : Turns on power to a RIICHS channel.
 * Arguments    : uint8_t channel
 * Return Value : none
 **********************************************************************************************************************/
void riichs_mcu_power_on (uint8_t channel)
{
    #if ((1U == RIICHS_CFG_CH0_INCLUDED))
    #if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    bsp_int_ctrl_t int_ctrl;
    #endif
    #endif
    /* Enable writing to MSTP registers. */
    R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);

