renesas/rx-driver-package/source/r_riichs_rx/r_riichs_rx_vx.xx/r_riichs_rx/src/targets/rx671/r_riichs_rx671.c
    /* Enable selected RIICHS Channel. */
    switch (channel)
    {
    #if (1U == RIICHS_CFG_CH0_INCLUDED)
        case 0x00 :

        #if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
            R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, &int_ctrl);
        #endif

            /* Bring module out of stop state. */
            MSTP(RIICHS0) = 0U;

        #if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
            R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, &int_ctrl);
        #endif
        break;
    #endif

        default :

            /* Should never get here. Valid channel number is checked above. */
        break;
    }

    /* Disable writing to MSTP registers. */
    R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);
} /* End of function riichs_mcu_power_on() */

/***********************************************************************************************************************
 * Function Name: riichs_mcu_power_off
 * Description  : Turns off power to a RIICHS channel.
 * Arguments    : uint8_t channel
 * Return Value : none
 **********************************************************************************************************************/
void riichs_mcu_power_off (uint8_t channel)
{
    #if ((1U == RIICHS_CFG_CH0_INCLUDED))
    #if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    bsp_int_ctrl_t int_ctrl;
    #endif
    #endif
    /* Enable writing to MSTP registers. */
    R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);

    /* Disable selected CMT Channel. */
    switch (channel)
    {
    #if (1U == RIICHS_CFG_CH0_INCLUDED)
        case 0x00 :

        #if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
            R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, &int_ctrl);
        #endif
            
            /* Put module in stop state. */
            MSTP(RIICHS0) = 1U;
            
        #if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
            R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, &int_ctrl);
        #endif
        break;
    #endif

        default :

            /* Should never get here. Valid channel number is checked above. */
        break;
    }

    /* Disable writing to MSTP registers. */
    R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);
} /* End of function riichs_mcu_power_off() */

/***********************************************************************************************************************
 * Function Name: riichs_mcu_int_icsier_iccsier_setting
 * Description  : Time out interrupt enable bit setting.
 * Arguments    : uint8_t channel
 *              : uint32_t New_icsier       ; New ICSIER value
 *              : uint32_t New_iccsier      ; New ICCSIER value
 * Return Value : None
 **********************************************************************************************************************/
void riichs_mcu_int_icsier_iccsier_setting (uint8_t channel, uint32_t New_icsier,uint32_t New_iccsier)
{
    volatile uint32_t uctmp = 0x00000000;

    /* Channel number? */
    switch (channel)
    {
    #if (1U == RIICHS_CFG_CH0_INCLUDED)
        case 0x00 : /* Channel 0 */
        if (1U == g_riichs_timeout_enable[0])
        {
            RIICHS0.ICSIER.LONG = (New_icsier | RIICHS_ICSIER_TMO);
            RIICHS0.ICCSIER.LONG = New_iccsier;
            uctmp = RIICHS0.ICSIER.LONG; /* Reads ICSIER. */
            uctmp = RIICHS0.ICCSIER.LONG; /* Reads ICCSIER. */
        }

        else
        {
            RIICHS0.ICSIER.LONG = New_icsier;
            RIICHS0.ICCSIER.LONG = New_iccsier;
            uctmp = RIICHS0.ICSIER.LONG; /* Reads ICSIER. */
            uctmp = RIICHS0.ICCSIER.LONG; /* Reads ICCSIER. */
        }

        break;
    #endif

        default :

            /* Please add a channel as needed. */
        break;
    }
} /* End of function riichs_mcu_int_icsier_iccsier_setting() */

/***********************************************************************************************************************
 * Function Name: riichs_mcu_int_enable
 * Description  : Clears interrupt request register.
 *              : Enables interrupt.
 * Arguments    : uint8_t channel
 * Return Value : None
 **********************************************************************************************************************/
void riichs_mcu_int_enable (uint8_t channel)
{
    #if ((1U == RIICHS_CFG_CH0_INCLUDED))
    volatile uint8_t uctmp = 0x00;
    volatile bsp_int_ctrl_t group_priority;
    #if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    bsp_int_ctrl_t int_ctrl;
    #endif
    group_priority.ipl = 0x00000000;

        #if (1U == RIICHS_CFG_CH0_INCLUDED)
    if (group_priority.ipl < g_riichs_eei_int_priority[0])
    {
        group_priority.ipl = (uint32_t) g_riichs_eei_int_priority[0];
    }
    if (group_priority.ipl < g_riichs_tei_int_priority[0])
    {
        group_priority.ipl = (uint32_t) g_riichs_tei_int_priority[0];
    }
        #endif

    R_BSP_InterruptControl(BSP_INT_SRC_AL1_RIICHS0_TEI, BSP_INT_CMD_GROUP_INTERRUPT_ENABLE, (void *) &group_priority);
    #endif

    /* Channel number? */
    switch (channel)
    {
    #if (1U == RIICHS_CFG_CH0_INCLUDED)
        case 0x00 : /* Channel 0 */

            /* Enables interrupt. */
        #if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
            R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, &int_ctrl);
        #endif
            RIICHS_IER_EEI0_GPAL1 = RIICHS_IER_ENABLE; /* Enables EEI0 groupAL1 interrupt request enable register. */
        #if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
            R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, &int_ctrl);
        #endif
            RIICHS_IER_RXI0 = RIICHS_IER_ENABLE; /* Enables RXI0 interrupt request enable register. */
            RIICHS_IER_TXI0 = RIICHS_IER_ENABLE; /* Enables TXI0 interrupt request enable register. */
        #if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
            R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, &int_ctrl);
        #endif
            RIICHS_IER_TEI0_GPAL1 = RIICHS_IER_ENABLE; /* Enables TEI0 groupAL1 interrupt request enable register. */
        #if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
            R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, &int_ctrl);
        #endif

            /* Sets interrupt source priority. */
            RIICHS_IPR_RXI0 = g_riichs_rxi_int_priority[0]; /* Sets RXI0 interrupt source priority register. */
            RIICHS_IPR_TXI0 = g_riichs_txi_int_priority[0]; /* Sets TXI0 interrupt source priority register. */
            uctmp = RIICHS_IPR_TXI0; /* Reads IPR. */
        break;
    #endif

        default :

