renesas/rx-driver-package/source/r_riichs_rx/r_riichs_rx_vx.xx/r_riichs_rx/src/targets/rx671/r_riichs_rx671.c
            /* Please add a channel as needed. */
        break;
    }
} /* End of function riichs_mcu_int_enable() */

/***********************************************************************************************************************
 * Function Name: riichs_mcu_int_disable
 * Description  : Disables interrupt.
 *              : Sets interrupt source priority.
 *              : Clears interrupt request register.
 * Arguments    : uint8_t channel
 * Return Value : None
 **********************************************************************************************************************/
void riichs_mcu_int_disable (uint8_t channel)
{
    #if ((1U == RIICHS_CFG_CH0_INCLUDED))
    volatile uint8_t uctmp = 0x00;
    volatile bsp_int_ctrl_t group_priority;
    #if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    bsp_int_ctrl_t int_ctrl;
    #endif
    #endif

    /* Channel number? */
    switch (channel)
    {
    #if (1U == RIICHS_CFG_CH0_INCLUDED)
        case 0x00 : /* Channel 0 */

            /* Disables interrupt. */
        #if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
            R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, &int_ctrl);
        #endif
            RIICHS_IER_EEI0_GPAL1 = RIICHS_IER_DISABLE; /* Disables TEI0 groupAL1 interrupt request enable register. */
        #if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
            R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, &int_ctrl);
        #endif
            RIICHS_IER_RXI0 = RIICHS_IER_DISABLE; /* Disables RXI0 interrupt request enable register. */
            RIICHS_IER_TXI0 = RIICHS_IER_DISABLE; /* Disables TXI0 interrupt request enable register. */
        #if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
            R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, &int_ctrl);
        #endif
            RIICHS_IER_TEI0_GPAL1 = RIICHS_IER_DISABLE; /* Disables TEI0 groupAL1 interrupt request enable register. */
        #if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
            R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, &int_ctrl);
        #endif

            /* Sets interrupt source priority. */
            RIICHS_IPR_RXI0 = g_riichs_rxi_int_priority[0]; /* Sets RXI0 interrupt source priority register. */
            RIICHS_IPR_TXI0 = g_riichs_txi_int_priority[0]; /* Sets TXI0 interrupt source priority register. */
            uctmp = RIICHS_IPR_TXI0; /* Reads IPR. */
        break;
    #endif

        default :

            /* Please add a channel as needed. */
        break;
    }

    group_priority.ipl = 0x00000000;
    R_BSP_InterruptControl(BSP_INT_SRC_AL1_RIICHS0_TEI, BSP_INT_CMD_GROUP_INTERRUPT_DISABLE, (void *) &group_priority);
} /* End of function riichs_mcu_int_disable() */

/***********************************************************************************************************************
 * Function Name: riichs_mcu_check_freq
 * Description  : check pclk frequency and return that value.
 * Arguments    : None
 * Return Value : PCLK frequency
 **********************************************************************************************************************/
double riichs_mcu_check_freq (void)
{
    return BSP_PCLKA_HZ;
} /* End of function riichs_mcu_check_freq() */

    #if (1U == RIICHS_CFG_CH0_INCLUDED)
/***********************************************************************************************************************
 * Function Name: riichs0_eei_isr
 * Description  : Interrupt EEI handler for channel 0.
 *                Types of interrupt requests transfer error or event generation.
 *                The event generations are arbitration-lost, NACK detection, timeout detection, 
 *                start condition detection, and stop condition detection.
 * Arguments    : None
 * Return Value : None
 **********************************************************************************************************************/
void riichs0_eei_isr (void * vect)
{
    riichs0_eei_sub();
} /* End of function riichs0_eei_isr() */

/***********************************************************************************************************************
 * Function Name: riichs0_txi_isr
 * Description  : Interrupt TXI handler for channel 0.
 *                Types of interrupt requests transmission data empty.
 * Arguments    : None
 * Return Value : None
 **********************************************************************************************************************/
R_BSP_PRAGMA_STATIC_INTERRUPT(riichs0_txi_isr, VECT(RIICHS0, TXI))
R_BSP_ATTRIB_STATIC_INTERRUPT void riichs0_txi_isr (void)
{
    riichs0_txi_sub();
} /* End of function riichs0_txi_isr() */

/***********************************************************************************************************************
 * Function Name: riichs0_rxi_isr
 * Description  : Interrupt RXI handler for channel 0.
 *                Types of interrupt requests reception end.
 * Arguments    : None
 * Return Value : None
 **********************************************************************************************************************/
R_BSP_PRAGMA_STATIC_INTERRUPT(riichs0_rxi_isr, VECT(RIICHS0, RXI))
R_BSP_ATTRIB_STATIC_INTERRUPT void riichs0_rxi_isr (void)
{
    riichs0_rxi_sub();
} /* End of function riichs0_rxi_isr() */

/***********************************************************************************************************************
 * Function Name: riichs0_tei_isr
 * Description  : Interrupt TEI handler for channel 0.
 *                Types of interrupt requests transmission end.
 * Arguments    : None
 * Return Value : None
 **********************************************************************************************************************/
void riichs0_tei_isr (void * vect)
{
    riichs0_tei_sub();
} /* End of function riichs0_tei_isr() */
    #endif

#endif /* defined(BSP_MCU_RX671) */

